app/controllers/post_images_controller.rb

  def create
    @post_image = PostImage.new(post_image_params)
    @post_image.user_id = current_user.id
    if @post_image.save
---
INSERT INTO "post_images" ("shop_name", "image_id", "caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def index
    @post_images = PostImage.page(params[:page]).reverse_order
---
SELECT  "post_images".* FROM "post_images" ORDER BY "post_images"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "post_images"

  def show
    @post_image = PostImage.find(params[:id])
---
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def destroy
    @post_image = PostImage.find(params[:id])
    @post_image.destroy
---
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "post_images" WHERE "post_images"."id" = ?  [["id", 1]]