app/views/post_images/index.html.erb

  <P>ユーザーネーム:<%= post_image.user.name %></P>
  <p><%= link_to "#{post_image.post_comments.count} コメント", post_image_path(post_image.id) %></p>
---
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."post_image_id" = ?  [["post_image_id", 1]]